particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    if (!s_bleInstance.advertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_stop(s_bleInstance.advHandle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_stop() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_bleInstance.advertising = false;
        return SYSTEM_ERROR_NONE;
    }
}

bool ble_is_advertising(void) {
    return s_bleInstance.advertising;
}

int ble_set_scanning_params(hal_ble_scan_params_t* scan_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_set_scanning_params().");

    if (scan_params->interval < BLE_GAP_SCAN_INTERVAL_MIN) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MIN;
    }
    if (scan_params->interval > BLE_GAP_SCAN_INTERVAL_MAX) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MAX;
    }
    if (scan_params->window < BLE_GAP_SCAN_WINDOW_MIN) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MIN;
    }
    if (scan_params->window > BLE_GAP_SCAN_WINDOW_MAX) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MAX;
    }

    memcpy(&s_bleInstance.scanParams, scan_params, sizeof(hal_ble_scan_params_t));

    return SYSTEM_ERROR_NONE;
}

int ble_start_scanning(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_start_scanning().");

    sd_ble_gap_scan_stop();
    s_bleInstance.scanning = false;

    ble_gap_scan_params_t bleGapScanParams;
    fromHalScanParams(&s_bleInstance.scanParams, &bleGapScanParams);

    LOG_DEBUG(TRACE, "| interval(ms)   window(ms)   timeout(ms) |");
    LOG_DEBUG(TRACE, "  %.3f        %.3f      %d",
            bleGapScanParams.interval*0.625,
            bleGapScanParams.window*0.625,
            bleGapScanParams.timeout*10);

    ret_code_t ret = sd_ble_gap_scan_start(&bleGapScanParams, &s_bleScanData);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    s_bleInstance.scanning = true;

    return SYSTEM_ERROR_NONE;
}

bool ble_is_scanning(void) {
    return s_bleInstance.scanning;
}

int ble_stop_scanning(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_stop_scanning().");

    ret_code_t ret = sd_ble_gap_scan_stop();
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    s_bleInstance.scanning = false;

    return SYSTEM_ERROR_NONE;
}

int ble_adv_data_decode(uint8_t flag, const uint8_t* adv_data, uint16_t adv_data_len, uint8_t* data, uint16_t* len) {
    std::lock_guard<bleLock> lk(bleLock());

    // An AD structure must consist of 1 byte length field, 1 byte type field and at least 1 byte data field
    if (adv_data == NULL || adv_data_len < 3) {
        *len = 0;
        return SYSTEM_ERROR_NOT_FOUND;
    }

    uint16_t dataOffset, dataLen;
    if (locateAdStructure(flag, adv_data, adv_data_len, &dataOffset, &dataLen) == SYSTEM_ERROR_NONE) {
        if (len != NULL) {
            dataLen = dataLen - 2;
            if (data != NULL && *len > 0) {
                // Only copy the data field of the found AD structure.
                *len = MIN(*len, dataLen);
                memcpy(data, &adv_data[dataOffset+2], *len);
            }
            *len = dataLen;
        }

        return SYSTEM_ERROR_NONE;
    }

    *len = 0;
    return SYSTEM_ERROR_NOT_FOUND;
}

int ble_connect(hal_ble_address_t* addr) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    s_bleInstance.scanning = false;

    ble_gap_addr_t devAddr;
    memset(&devAddr, 0x00, sizeof(ble_gap_addr_t));
    devAddr.addr_type = addr->addr_type;
    memcpy(devAddr.addr, addr->addr, BLE_SIG_ADDR_LEN);

    ble_gap_scan_params_t bleGapScanParams;
    fromHalScanParams(&s_bleInstance.scanParams, &bleGapScanParams);

    ble_gap_conn_params_t connParams;
    fromHalConnParams(&s_bleInstance.ppcp, &connParams);

    ret_code_t ret = sd_ble_gap_connect(&devAddr, &bleGapScanParams, &connParams, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_connect() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    s_bleInstance.connecting = true;

    return 0;
}

bool ble_is_connecting(void) {
    return s_bleInstance.connecting;
}

bool ble_is_connected(void) {
    return s_bleInstance.connected;
}

int ble_connect_cancel(void) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_connect_cancel().");

    if (s_bleInstance.connecting) {
        ret_code_t ret = sd_ble_gap_connect_cancel();
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_connect_cancel() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

        s_bleInstance.connecting = false;
    }

    return 0;
}

int ble_set_ppcp(hal_ble_conn_params_t* conn_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_set_ppcp().");

    if (conn_params == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (conn_params->min_conn_interval < BLE_SIG_CP_MIN_CONN_INTERVAL_MIN ||
            conn_params->min_conn_interval > BLE_SIG_CP_MIN_CONN_INTERVAL_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (conn_params->max_conn_interval < BLE_SIG_CP_MAX_CONN_INTERVAL_MIN ||
            conn_params->max_conn_interval > BLE_SIG_CP_MAX_CONN_INTERVAL_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (conn_params->slave_latency > BLE_SIG_CP_SLAVE_LATENCY_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (conn_params->conn_sup_timeout < BLE_SIG_CP_CONN_SUP_TIMEOUT_MIN ||
            conn_params->conn_sup_timeout > BLE_SIG_CP_CONN_SUP_TIMEOUT_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

