particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    ble_gap_conn_params_t connParams;
    fromHalConnParams(conn_params, &connParams);

    ret_code_t ret = sd_ble_gap_ppcp_set(&connParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_ppcp_set() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    memcpy(&s_bleInstance.ppcp, conn_params, sizeof(hal_ble_conn_params_t));

    return SYSTEM_ERROR_NONE;
}

int ble_get_ppcp(hal_ble_conn_params_t* conn_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_get_ppcp().");

    if (conn_params == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gap_conn_params_t connParams;
    ret_code_t ret = sd_ble_gap_ppcp_get(&connParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_ppcp_set() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    conn_params->min_conn_interval = connParams.min_conn_interval;
    conn_params->max_conn_interval = connParams.max_conn_interval;
    conn_params->slave_latency     = connParams.slave_latency;
    conn_params->conn_sup_timeout  = connParams.conn_sup_timeout;

    return SYSTEM_ERROR_NONE;
}

int ble_update_connection_params(uint16_t conn_handle, hal_ble_conn_params_t* conn_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_update_connection_params().");

    ret_code_t ret;

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (conn_params == NULL) {
        // For Central role, this will reject the connection parameter update request.
        // For Peripheral role, this will use the PPCP characteristic value as the connection parameters,
        // and send the request to Central.
        ret = sd_ble_gap_conn_param_update(conn_handle, NULL);
    }
    else {
        // For Central role, this will initiate the connection parameter update procedure.
        // For Peripheral role, this will use the passed in parameters and send the request to central.
        ble_gap_conn_params_t connParams;
        connParams.min_conn_interval = conn_params->min_conn_interval;
        connParams.max_conn_interval = conn_params->max_conn_interval;
        connParams.slave_latency     = conn_params->slave_latency;
        connParams.conn_sup_timeout  = conn_params->conn_sup_timeout;
        ret = sd_ble_gap_conn_param_update(conn_handle, &connParams);
    }

    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int hal_ble_disconnect(uint16_t conn_handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "hal_ble_disconnect().");

    if (!s_bleInstance.connected) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    else if (s_bleInstance.role == BLE_ROLE_PERIPHERAL) {
        conn_handle = s_bleInstance.connHandle;
    }
    else if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ret_code_t ret = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_add_service_uuid128(uint8_t type, const uint8_t* uuid128, uint16_t* handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_add_service_uuid128().");

    ble_uuid_t     svcUuid;
    hal_ble_uuid_t halUuid;

    if (uuid128 == NULL || handle == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    halUuid.type = BLE_UUID_TYPE_128BIT;
    memcpy(halUuid.uuid128, uuid128, BLE_SIG_UUID_128BIT_LEN);

    int ret = fromHalUuid(&halUuid, &svcUuid);
    if (ret == SYSTEM_ERROR_NONE) {
        ret = addService(type, &svcUuid, handle);
    }

    return ret;
}

int ble_add_service_uuid16(uint8_t type, uint16_t uuid16, uint16_t* handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_add_service_uuid16().");

    if (handle == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_uuid_t svcUuid;
    svcUuid.type = BLE_UUID_TYPE_BLE;
    svcUuid.uuid = uuid16;

    return addService(type, &svcUuid, handle);
}

int ble_add_char_uuid128(uint16_t service_handle, const uint8_t *uuid128, uint8_t properties, const char* desc, hal_ble_char_t* ble_char) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_add_char_uuid128().");

    ble_uuid_t     charUuid;
    hal_ble_uuid_t halUuid;

    if (uuid128 == NULL || ble_char == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    halUuid.type = BLE_UUID_TYPE_128BIT;
    memcpy(halUuid.uuid128, uuid128, BLE_SIG_UUID_128BIT_LEN);

    int ret = fromHalUuid(&halUuid, &charUuid);
    if (ret == SYSTEM_ERROR_NONE) {
        ret = addCharacteristic(service_handle, &charUuid, properties, desc, ble_char);
        if (SYSTEM_ERROR_NONE == ret) {
            ble_char->uuid.type = BLE_UUID_TYPE_128BIT;
            memcpy(ble_char->uuid.uuid128, uuid128, BLE_SIG_UUID_128BIT_LEN);
        }
    }

    return ret;
}

int ble_add_char_uuid16(uint16_t service_handle, uint16_t uuid16, uint8_t properties, const char* desc, hal_ble_char_t* ble_char) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_add_char_uuid16().");

    if (ble_char == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_uuid_t charUuid;
    charUuid.type = BLE_UUID_TYPE_BLE;
    charUuid.uuid = uuid16;

    int error = addCharacteristic(service_handle, &charUuid, properties, desc, ble_char);
    if (SYSTEM_ERROR_NONE == error) {
        ble_char->uuid.type   = BLE_UUID_TYPE_16BIT;
        ble_char->uuid.uuid16 = uuid16;
    }

    return error;
}

int ble_add_char_desc(uint8_t* desc, uint16_t len, hal_ble_char_t* ble_char) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

