particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    return writeAttribute(conn_handle, ble_char->cccd_handle, buf, 2, true);
}

int ble_write(uint16_t conn_handle, hal_ble_char_t* ble_char, uint8_t* data, uint16_t len, bool response) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_write().");

    if (conn_handle == BLE_CONN_HANDLE_INVALID || ble_char == NULL || ble_char->value_handle == BLE_INVALID_ATTR_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if ((ble_char->properties & BLE_SIG_CHAR_PROP_WRITE_WO_RESP) || (ble_char->properties & BLE_SIG_CHAR_PROP_WRITE)) {
        return writeAttribute(conn_handle, ble_char->value_handle, data, len, response);
    }
    else {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
}

int ble_read(uint16_t conn_handle, hal_ble_char_t* ble_char) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_read().");

    if (ble_char->properties & BLE_SIG_CHAR_PROP_READ) {
        ret_code_t ret = sd_ble_gattc_read(conn_handle, ble_char->value_handle, 0);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gattc_read() failed: %u", (unsigned)ret);
            return sysError(ret);
        }
        return SYSTEM_ERROR_NONE;
    }
    else {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
}

int ble_get_rssi(uint16_t conn_handle) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_get_rssi().");

    return 0;
}

int ble_discover_all_services(uint16_t conn_handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_discovery_all_services().");

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (s_bleInstance.discovery.currDiscProcedure != BLE_DISCOVERY_PROCEDURE_IDLE) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    ret_code_t ret = sd_ble_gattc_primary_services_discover(conn_handle, 0x01, NULL);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    memset(&s_bleInstance.discovery, 0x00, sizeof(s_bleInstance.discovery));
    s_bleInstance.discovery.discAll = true;
    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_SERVICES;
    s_bleInstance.discovering = true;

    return SYSTEM_ERROR_NONE;
}

int ble_discover_service_by_uuid128(uint16_t conn_handle, const uint8_t *uuid128) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_discovery_service_by_uuid128().");

    if (conn_handle == BLE_INVALID_CONN_HANDLE || uuid128 == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (s_bleInstance.discovery.currDiscProcedure != BLE_DISCOVERY_PROCEDURE_IDLE) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    ble_uuid_t     svcUuid;
    hal_ble_uuid_t halUuid;
    halUuid.type = BLE_UUID_TYPE_128BIT;
    memcpy(halUuid.uuid128, uuid128, BLE_SIG_UUID_128BIT_LEN);

    int ret = fromHalUuid(&halUuid, &svcUuid);
    if (ret == SYSTEM_ERROR_NONE) {
        ret = sd_ble_gattc_primary_services_discover(conn_handle, 0x01, &svcUuid);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

        memset(&s_bleInstance.discovery, 0x00, sizeof(s_bleInstance.discovery));
        s_bleInstance.discovery.discAll = false;
        s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_SERVICES;
        s_bleInstance.discovering = true;

        return SYSTEM_ERROR_NONE;
    }

    return ret;
}

int ble_discover_service_by_uuid16(uint16_t conn_handle, uint16_t uuid) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_discovery_service_by_uuid16().");

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (s_bleInstance.discovery.currDiscProcedure != BLE_DISCOVERY_PROCEDURE_IDLE) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    ble_uuid_t svcUuid;
    svcUuid.type = BLE_UUID_TYPE_BLE;
    svcUuid.uuid = uuid;

    ret_code_t ret = sd_ble_gattc_primary_services_discover(conn_handle, 0x01, &svcUuid);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_primary_services_discover() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    memset(&s_bleInstance.discovery, 0x00, sizeof(s_bleInstance.discovery));
    s_bleInstance.discovery.discAll = false;
    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_SERVICES;
    s_bleInstance.discovering = true;

    return SYSTEM_ERROR_NONE;
}

int ble_discover_characteristics(uint16_t conn_handle, uint16_t start_handle, uint16_t end_handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_discover_characteristics().");

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gattc_handle_range_t handleRange;
    handleRange.start_handle = start_handle;
    handleRange.end_handle   = end_handle;

    ret_code_t ret = sd_ble_gattc_characteristics_discover(conn_handle, &handleRange);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_characteristics_discover() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    memset(&s_bleInstance.discovery, 0x00, sizeof(s_bleInstance.discovery));
    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS;
    s_bleInstance.discovery.discStartHandle = start_handle;
    s_bleInstance.discovery.discEndHandle = end_handle;
    s_bleInstance.discovering = true;

    return SYSTEM_ERROR_NONE;
}

int ble_discover_descriptors(uint16_t conn_handle, uint16_t start_handle, uint16_t end_handle) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInstance.initialized);

    LOG_DEBUG(TRACE, "ble_discover_descriptors().");

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gattc_handle_range_t handleRange;
    handleRange.start_handle = start_handle;
    handleRange.end_handle   = end_handle;

    ret_code_t ret = sd_ble_gattc_descriptors_discover(conn_handle, &handleRange);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    memset(&s_bleInstance.discovery, 0x00, sizeof(s_bleInstance.discovery));
    s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_DESCRIPTORS;
    s_bleInstance.discovery.discStartHandle = start_handle;
    s_bleInstance.discovery.discEndHandle = end_handle;
    s_bleInstance.discovering = true;

    return SYSTEM_ERROR_NONE;
}

bool ble_is_discovering(void) {
    return s_bleInstance.discovering;
}


